export function slugify(text: string) {
  return text
    .replace(/[^\x00-\x7F]/g, asciiEquivalent)
    .replace(/[ _]+/g, '-')
    .replace(/--+/g, '-')
    .replace(/[^\w-]+/g, '')
    .replace(/^-+/, '')
    .replace(/-+$/, '')
    .toLowerCase()
}

function asciiEquivalent(char: string) {
  return MAP_NON_ASCII_TO_ASCII.get(char) ?? ''
}

const MAP_NON_ASCII_TO_ASCII = new Map([
  ['ä', 'ae'],
  ['æ', 'ae'],
  ['ǽ', 'ae'],
  ['ö', 'oe'],
  ['œ', 'oe'],
  ['ü', 'ue'],
  ['Ä', 'Ae'],
  ['Ü', 'Ue'],
  ['Ö', 'Oe'],
  ['À', 'A'],
  ['Á', 'A'],
  ['Â', 'A'],
  ['Ã', 'A'],
  ['Å', 'A'],
  ['Æ', 'Ae'],
  ['Ç', 'C'],
  ['È', 'E'],
  ['É', 'E'],
  ['Ê', 'E'],
  ['Ë', 'E'],
  ['Ì', 'I'],
  ['Í', 'I'],
  ['Î', 'I'],
  ['Ï', 'I'],
  ['Ð', 'D'],
  ['Ñ', 'N'],
  ['Ò', 'O'],
  ['Ó', 'O'],
  ['Ô', 'O'],
  ['Õ', 'O'],
  ['Œ', 'Oe'],
  ['Ø', 'O'],
  ['Ù', 'U'],
  ['Ú', 'U'],
  ['Û', 'U'],
  ['Ü', 'Ue'],
  ['Ý', 'Y'],
  ['Þ', 'Th'],
  ['ß', 'ss'],
  ['à', 'a'],
  ['á', 'a'],
  ['â', 'a'],
  ['ã', 'a'],
  ['å', 'a'],
  ['æ', 'ae'],
  ['ç', 'c'],
  ['è', 'e'],
  ['é', 'e'],
  ['ê', 'e'],
  ['ë', 'e'],
  ['ì', 'i'],
  ['í', 'i'],
  ['î', 'i'],
  ['ï', 'i'],
  ['ð', 'd'],
  ['ñ', 'n'],
  ['ò', 'o'],
  ['ó', 'o'],
  ['ô', 'o'],
  ['õ', 'o'],
  ['ö', 'oe'],
  ['œ', 'oe'],
  ['ø', 'o'],
  ['ù', 'u'],
  ['ú', 'u'],
  ['û', 'u'],
  ['ü', 'ue'],
  ['ý', 'y'],
  ['þ', 'th'],
  ['ÿ', 'y'],
  ['ẞ', 'ss'],
])
